In [1]:
import seaborn as sns
df = sns.load_dataset('titanic')
df.to_csv('titanic.csv', index=False)
print("✅ Titanic dataset saved as 'titanic.csv'")

✅ Titanic dataset saved as 'titanic.csv'

In [2]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.drop(columns=['deck'], inplace=True, errors='ignore')

In [4]:
df['age'] = df['age'].fillna(df['age'].median())
df['embarked'] = df['embarked'].fillna(df['embarked'].mode()[0])

# Drop 'deck' if it exists
df.drop(columns=['deck'], inplace=True, errors='ignore')

In [5]:
Q1 = df['fare'].quantile(0.25)
Q3 = df['fare'].quantile(0.75)
IQR = Q3 - Q1
df = df[(df['fare'] >= Q1 - 1.5 * IQR) & (df['fare'] <= Q3 + 1.5 * IQR)]

In [6]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder, StandardScaler

In [8]:
le = LabelEncoder()
df.loc[:, 'sex'] = le.fit_transform(df['sex'])
df.loc[:, 'embarked'] = le.fit_transform(df['embarked'])

In [9]:
scaler = StandardScaler()
df.loc[:, ['age', 'fare']] = scaler.fit_transform(df[['age', 'fare']])

# logistic regression

In [12]:
print(df.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [13]:
X = df.drop('survived', axis=1)
y = df['survived']

In [24]:
print(df.columns.tolist())

['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive', 'alone']

In [28]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()

for col in df.columns:
    if df[col].dtype == 'object':
        df[col] = label_encoder.fit_transform(df[col].astype(str))

In [29]:
# Import libraries
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix

# Encode categorical columns with LabelEncoder (if ordinal, like Pclass)
label_encoder = LabelEncoder()
df['class'] = label_encoder.fit_transform(df['class'])
df['sex'] = label_encoder.fit_transform(df['sex'])
df['embarked'] = label_encoder.fit_transform(df['embarked'].fillna('S'))  # Fill missing 'Embarked' values

# Define features and target
X = df.drop('survived', axis=1)
y = df['survived']

# Split the data into training and testing sets (80% train, 20% test)
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Initialize and train the Logistic Regression model
model = LogisticRegression(max_iter=1000)
model.fit(X_train, y_train)

# Make predictions
y_pred = model.predict(X_test)

# Evaluate the model
print("Accuracy:", accuracy_score(y_test, y_pred))
print("Classification Report:\n", classification_report(y_test, y_pred))
print("Confusion Matrix:\n", confusion_matrix(y_test, y_pred))

Accuracy: 1.0
Classification Report:
               precision    recall  f1-score   support

           0       1.00      1.00      1.00        95
           1       1.00      1.00      1.00        60

    accuracy                           1.00       155
   macro avg       1.00      1.00      1.00       155
weighted avg       1.00      1.00      1.00       155

Confusion Matrix:
 [[95  0]
 [ 0 60]]

In [30]:
df.to_csv("titanic_cleaned.csv", index=False)
print("cleaned dataset saved as 'titanic_cleaned.csv'")

cleaned dataset saved as 'titanic_cleaned.csv'

In [31]:
df.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
493,0,0,1,3.307633,0,0,2.334834,0,0,1,True,0,0,True
752,0,2,1,0.332811,0,0,-0.613302,2,2,1,True,2,0,True
222,0,2,1,1.741938,0,0,-0.720161,2,2,1,True,2,0,True
767,0,2,0,0.137099,0,0,-0.742269,1,2,2,False,1,0,True
857,1,0,1,1.741938,0,0,0.643209,2,0,1,True,2,1,True